Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособПодключенияДрайвера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СпособПодключенияДрайвера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзМакета</Name>
					<Comment>Установка драйвера осуществляется из макета конфигурации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛокальноПоИдентификатору</Name>
					<Comment>Подключатся драйвер, установленный на локальном компьютере по ProgID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзИнформационнойБазы</Name>
					<Comment>Установка драйвера осуществляется из информационной базы</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОборудованиеТерминалыСбораДанныхОбновление/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
//
// Параметры:
//  ДрайвераОборудования - см. МенеджерОборудования.НоваяТаблицаПоставляемыхДрайверовОборудования
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверГексагонТерминалыСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Гексагон:Терминалы сбора данных Goods'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ProtonTSD"; 
	Драйвер.ВерсияДрайвера = "8.4.2"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверКлеверенсТерминалыСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Клеверенс:Терминалы сбора данных'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "Cleverence.TO_TSD"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверАтолТерминалыСбораДанныхMobileLogistics";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:Терминалы сбора данных Mobile Logistics 8.Х'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "PDX1C_Int"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверRightScanТерминалыСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Right Scan:Терминалы сбора данных (ПО RS:Mobile ACS)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "RSExchange"; 
	Драйвер.ВерсияДрайвера = "2.68"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканкодТерминалыСбораДанныхNative";
	Драйвер.Наименование = НСтр("ru = 'Сканкод:Терминалы сбора данных Cipher LAB 8x00 (Native Api)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "CipherLab8"; 
	Драйвер.ВерсияДрайвера = "1.0.0.9"; 
	Драйвер.СнятСПоддержки = Истина;
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканкодТерминалыСбораДанныхCipherLab8G2";
	Драйвер.Наименование = НСтр("ru = 'Сканкод:Терминалы сбора данных Cipher Lab 8 G2'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "CipherLab8G2"; 
	Драйвер.ВерсияДрайвера = "2.0.0.24"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканситиТерминалСбораДанныхCitySoftBusiness";
	Драйвер.Наименование = НСтр("ru = 'Скансити:Терминал сбора данных City-Soft Business'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "CitySoftBusinessDriver"; 
	Драйвер.ВерсияДрайвера = "4.0.12.747"; 
	Драйвер.СнятСПоддержки = Истина;       
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканситиТерминалСбораДанныхCitySoftLite";
	Драйвер.Наименование = НСтр("ru = 'Скансити:Терминал сбора данных City-Soft Lite'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "CitySoftLiteEquipmentDriver"; 
	Драйвер.ВерсияДрайвера = "5.8.3.260"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканситиТерминалСбораДанныхCitySoftStandart";
	Драйвер.Наименование = НСтр("ru = 'Скансити:Терминал сбора данных City-Soft Standart'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "CitySoftStandartDriver"; 
	Драйвер.ВерсияДрайвера = "4.5.0.881"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверХарвестрТерминалыСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Харвестр:Приложение сбора данных'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "HarvesterEquipmentNative"; 
	Драйвер.ВерсияДрайвера = "1.2.3.8";   
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканпортТерминалСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Сканпорт:Терминал сбора данных'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "DmTsdDriver"; 
	Драйвер.ВерсияДрайвера = "1.0.1"; 
	
КонецПроцедуры

#КонецОбласти
